<?php
$cities = [
    "Московская область" => ["Москва", "Зеленоград", "Клин"],
    "Ленинградская область" => ["Санкт-Петербург", "Всеволожск", "Павловск", "Кронштадт"],
    "Рязанская область" => ["Рязань", "Касимов", "Скопин", "Сасово", "Ряжск"],
    "Нижегородская область" => ["Нижний Новгород", "Арзамас", "Дзержинск", "Бор"],
    "Новосибирская область" => ["Новосибирск", "Бердск", "Искитим", "Куйбышев"]
];

foreach ($cities as $region => $citiesList) {
    echo "$region:\n";
    echo implode(", ", $citiesList) . ".\n\n";
}
?>